{"_id":{"$oid":"5b929a74692b4810708be520"},"details":{"title":"Bitcoin","summary":"Bitcoin could be called the first cryptocurrency that survived 8 years of ruthless critique and attacks., yet still goes strong as the top cryptocurrency. In the spirit of BitTorrent, Bitcoin tries to decentralize the monetary system using a peer-to-peer network, where people can send their money to anyone in the world, if they also use a Bitcoin wallet or run a Bitcoin node. \n\nBitcoin's makes use of distributed computing and cryptography, to make double-spending impossible, while allowing to send the equivalent of millions of dollars to anyone in the world.\n\n## Mining and confirming transactions\n\nBitcoins are \"earned\" and created by means of mining. Mining is a process where any computer can join in the process of mathematically validating \"blocks\" of transactions, checking for their validity and non-double-spending.\n\nAfter validation, they get chained to previously validated blocks of transactions, creating a blockchain, and the node validating the block gets rewarded with a mathematically established amount of bitcoins (currently 4).\n\n## Proof-of-Work\n\nIn bitcoin, miners need not only validate a block, but also proof that they worked \"this hard\" to get to a validated block. This mechanism is called proof-of-work and essentially gives everyone in the network a fair shot at validating blocks based on computing power. Experts say that this gives bitcoin \"intrinsic value\", even though that word in itself is an oxymoron.","reference_links":[{"_id":{"$oid":"5bb3589ab69e4c2e3c00f0cc"},"name":"Homepage","url":"https://bitcoin.org/en/"}],"trade_off":{"pros":["Established","Less volatile than certain world currencies","No inflation","Decentralized"],"cons":["7 tx / sec","Bad scaling","Hard to solomine","Mining Pools defeat decentralization"]}},"name":"Bitcoin","logo_url":"https://en.bitcoin.it/w/images/en/2/29/BC_Logo_.png","groupId":"5bacd0256a6a8a4e5c77b5b2","__v":0,"meta":{"color":"linear-gradient(45deg, #fc466b, #FFA447)","symbol":"BTC"},"groupIds":["5bacd0256a6a8a4e5c77b5b2"]}
{"_id":{"$oid":"5b929a8e692b4810708be521"},"details":{"title":"Ethereum","summary":"Ethereum, currently the second biggest cryptocurrency in the world,  brought a \"programmable blockchain\" to the world. In a similar fashion to other cryptocurrencies, Ethereum allows users to create wallets, send money (in Eth) to other users, while avoiding double spending-issues and making the transactions secure and indesputable. Ethereum is an public blockchain, meaning that everyone can join the network, see transactions and validate them.\n\nTransactions are mined on Ethereum nodes with a proof-of-work algorithm (Ethash) which makes it ASIC resistant because of the large memory required to make the calculations. Validated transactions are added to the blockchain and the miner gets a reward in form of Ethereum. Solo-mining is unviable at this point, but people may still built GPU-based mining rigs and join a mining pool for more chances to get a reward.\n\n## Smart Contracts\n\nThe thing that makes Ethereum special is the toolset it provides: you can write executable code in a secure and temper-resistant manner. These are called **smart contracts**. They are self-executing pieces of code that can do more than just send money from wallet A to B, but also store states of information, conditionally send money, create sophisticated multi-signature wallets or anything else.\n\nUsing smart contracts one can build any kind of decentralized application that's okay with the fact that all information is out there in the public on the public blockchain.\n\n## EVM\n\nThe Ethereum Virtual Machine (EVM), similar to a Java Virtual Machine, is an isolated and local-running program on every node which executes compiled smart contract code written in Solidity or Vyper.\n\nSmart contract execution on a node costs \"gas\". This is a value attributed to every single piece of code that gets executed on the blockchain. For example, contract deployment costs 53 000 gas, while submitting a transaction 500 gas. The price for executing a smart contract is the total **gas cost** times the **gas price**, measured in Gwei. 1 Gwei is 1 billionth of 1 Eth, or 0.000 000 001 ETH.\n\nAside from mining, miners receive their reward in gas price as \"fee\" for their hard work.\n\n## Proof of Stake\n\nDue it's proof-of-work algorithm to have a distribured consensus algrithm, Ethereum faces its limits towards scalability, allowing up to 10-30 transactions per second, while it takes 10 minutes to validate a transaction. This is because the whole network has to synchronize in order to validate next blocks, to update its world state.\n\nThe solution offered by the Ethereum team comes from moving away from proof-of-work, towards proof-of-stake.\n\nIn the proof-of-stake algorithm called Casper, people with over 5000 Ethereum will be able to stake their capital on a node running a smart contract which will validate transactions. When validating transactions, a Casper node will see 2-5% returns per year on their invested stake. People with less than 5000 Ethereum, can join stake-pools to participate in the model.\n\nThere is a catch however: Casper nodes will get penalized heavily when validating faulthy transactions, doing shady stuff or simply go offline for an hour or day. Going offline for a week would cause 50% elimination of staked capital, giving an incentive for Casper nodes to write their own code, have their own hardware setups and be responsible for their own internet connection. This will cause the Casper validation nodes to be more decentralized, both in in software and hardware, while increasing the throughput tremendously.","reference_links":[{"_id":{"$oid":"5bb354d2ff6fd560dce37bb7"},"name":"Homepage","url":"https://ethereum.org/"},{"_id":{"$oid":"5bb354d2ff6fd560dce37bb6"},"name":"Source","url":"https://github.com/ethereum"}],"trade_off":{"pros":["Most robust blockchain app platform","Casper nodes look promising","Still operates on Proof-of-Work"],"cons":["Currently scales badly","Expensive gas cost harms development","No Privacy"]}},"name":"Ethereum","logo_url":"https://seeklogo.com/images/E/ethereum-logo-1C9A722BB1-seeklogo.com.png","groupId":"5bacd0256a6a8a4e5c77b5b2","__v":0,"meta":{"color":"linear-gradient(45deg, #fc466b, #FFA447)","symbol":"ETH"},"groupIds":["5bacd0256a6a8a4e5c77b5b2","5bb290aa72468835c427e86c"]}
{"_id":{"$oid":"5b97ae0aaa50118763262bb7"},"details":{"title":"IOTA","summary":"One of the best blockchains, currently leading in the top x\n","reference_links":[],"trade_off":{"pros":[],"cons":[]}},"name":"Ethereum","logo_url":"https://d3npzzrehyahmo.cloudfront.net/images/a2/d0/a2d0a422b38e8427adb36450d17e69f1_11156357cf86_t.png","groupId":"5bacd0256a6a8a4e5c77b5b2","__v":0,"meta":{"color":"linear-gradient(45deg, #fc466b, #FFA447)","symbol":"IOTA"},"groupIds":["5bacd0256a6a8a4e5c77b5b2"]}
{"_id":{"$oid":"5b97cecbb020144edc5951cc"},"details":{"title":"NEM","summary":"Nem is a blockchain for business to allow containerized transactions to occur.\n\n## Key Takeaways:\n\n- a\n- b\n- c\n\n## disadvantages\n\nAdd a text here to specify how exactly everything is gonna look like on the NEM blockchain\n\nNem is a blockchain for business to allow containerized transactions to occur.\n\n## Key Takeaways:\n\n- a\n- b\n- c\n\n## disadvantages\n\nAdd a text here to specify how exactly everything is gonna look like on the NEM blockchain","reference_links":[{"_id":{"$oid":"5bb35891b69e4c2e3c00f0cb"},"name":"Homepage","url":"https://nem.io/"},{"_id":{"$oid":"5bb35891b69e4c2e3c00f0ca"},"name":"Technical Ref","url":"https://nem.io/wp-content/themes/nem/files/NEM_techRef.pdf"},{"_id":{"$oid":"5bb35891b69e4c2e3c00f0c9"},"name":"Source Code","url":"tps://github.com/NemProject"}],"trade_off":{"pros":["One Strong Point","Another very strong point"],"cons":["One Weak Point"]}},"name":"NEM","logo_url":"https://cdn.coinranking.com/Bkvu9rOOZ/xem.svg","groupId":"5bacd0256a6a8a4e5c77b5b2","__v":0,"meta":{"color":"linear-gradient(45deg, #fc466b, #FFA447)","symbol":"XEM"},"groupIds":["5bacd0256a6a8a4e5c77b5b2"]}
{"_id":{"$oid":"5ba50bf596e7002a808615b2"},"meta":{"color":"linear-gradient(45deg, #fc466b, #FFA447)","symbol":"XRP"},"details":{"title":"XRP","summary":"XRP, often called 'Ripple' is often misunderstood as a stand-alone cryptocurrency, whereas it's a native token which supports Ripple's FinTech products xCurrent and xRapid. It's important to understand what Ripple does before one can understand how XRP functions in this context.\n\n## Ripple, The Company\n\nRipple (the company) tries to solve big transaction costs between payment settlements across banks. It achieves this by connecting banks together by providing cryptograpically secured smart contracts that act as escrow services.\n\n## xCurrent - Escrow Services\n\nEscrow Services allow a thrusted middle-man to first receive and hold money or assets until the receiving party fullfills its conditions for receipt. This protects both the sender and receiver, as the sender thrusts the escrow service that his money will return of the receiving party doesn't meet the conditions, and the receiving party because it knows the funds or assets actually exist and are ready to be send to them after the conditions are met.\n\nInstead of thrusting a human middle-man, one could thrusts cryptographically secured smart contracts performing this exact job.\n\nIn case of Ripple's xCurrent product, multiple escrow contracts are constructed between many banks, allowing for fast, secure and indisputable payment settlements to occur.\n\n## xRapid - Where XRP comes in\n\ninstead of issueing payments by sourcing liquidity routes through payment providers, banks can choose to cut out these middle men by transfering the funds to one another directly, using XRP.\n\nBanks could either hold XRP on their ledgers, or have dedicated liquidity lines (Fiat-to-XRP \u0026 XRP-to-Fiat) to make settlements happen in matter of seconds.\n\nThe sending bank converts their fiat into XRP, the network settles the payment within 4 seconds, and the receiving bank convert the received XRP into fiat. This is provided through the xRapid platform.\n\nXRP is thus a cryptocurrency to support interledger operability between banks, operating on the Ripple Protocol Consensus Algorithm, making XRP secure and reliable like other cryptocurrencies.\n\n## XRP Consensus Mechanics\n\nSimilar to Ethereum, XRP synchronizes the 'world state' by aggregating transactions, however, instead of using blocks, **ledger version** are introduced. \n\nIncoming transactions are aggregated by every node on the network every 2 seconds into a **candidate set**. Every node does this, creating individual perception of the ledger state, together they form an **open ledger**. Through Ripple's consensus algorithm, individual ledgers get compared with each other until they converge into a canonical agreement of transactions. This gets appended to the ledger, which is known as the **last closed ledger**, which is the current state of the network.\n\n## UNL\n\nUNLs are **unique node lists** validating nodes use to communicate with each other and come to a consensus. Currently, Ripple established a default UNL of thrusted validators to overcome sybil attacks, but a growing number of independent validators is being introduced to the network. 80% of nodes listen in the UNL have to agree on a transaction within the **open ledger** before consensus is hit. This 80% parameter is called **quorum**.\n\nThe consensus solves the double-spend problem, while transaction sequencing is deterministic in Ripple's conensus algorithm. This is not the case for proof-of-work based protocols where miners play a role in determining which transactions and when they are admitted to each block.\n\n","reference_links":[{"_id":{"$oid":"5bb358a4b69e4c2e3c00f0ce"},"name":"Homepage","url":"https://ripple.com/"},{"_id":{"$oid":"5bb358a4b69e4c2e3c00f0cd"},"name":"Resources","url":"https://ripple.com/collateral/#xrp"}],"trade_off":{"pros":["3.84 sec confirmations","VISA Speed Throughput (1500+ Tx/Sec)","No Proof-of-work algorithm","Open Source Consensus Algorithm"],"cons":["UNL is currently a case against full decentralization","One party controlls the source code and hard forks","No node sovereignty or incentive"]}},"name":"XRP","logo_url":"https://bitnewstoday.com/upload/iblock/858/8582a19438f543bade21b66c237695e2.jpg","groupId":"5bacd0256a6a8a4e5c77b5b2","__v":0,"groupIds":["5bacd0256a6a8a4e5c77b5b2"]}
{"_id":{"$oid":"5ba901b211fee62c08ad5e45"},"meta":{"color":"linear-gradient(45deg, #fc466b, #FFA447)","symbol":"XLM"},"details":{"title":"Stellar","summary":"Stellar (IBM's LUMEN) is a blockchain ...","reference_links":[],"trade_off":{"pros":[],"cons":[]}},"name":"Stellar","logo_url":"https://www.stellar.org/wp-content/themes/stellar/images/stellar-rocket-300.png","groupId":"5bacd0256a6a8a4e5c77b5b2","__v":0,"groupIds":["5bacd0256a6a8a4e5c77b5b2"]}
{"_id":{"$oid":"5baa507f1c31a0412470ad6b"},"details":{"title":"Corda","summary":"# Corda\n\nCorda aims at streamlining the auditing processes within and between organizations by leveraging the power of blockchain.\n\nIt features an open source blockchain platform to record, manage and synchronise agreements and tranfers of value between companies. It was designed from the ground up for businesses, allowing to build interoperable blockchain networks that transact directly, and in strict privacy.\n\n## Enterprise Operability\n\nCorda chose to use 3 core technologies which have a proven track record in business industries:\n\n1. **Java** [Kotlin], for containerized code execution with SQX support\n2. **Message Queue**, for asynchronous point-to-point communication between services\n3. **Relational Databases**, for storing the ledger states\n\n## 3th Generation Blockchain\n\nCorda tries to improve on the second generation blockchain shortcomings (eg. Ethereum), which are:\n\n1. **Privacy \u0026 Identity**\n\n   As a company you want to choose which data on the blockchain should be public or remain private between specified parties\n\n   As a company you want to have your users uniquely identified and non-repudiable (someone can't claim to be someone else after being given an identity).\n\n2. **Transaction Finality**\n\n   In Ethereum \u0026 Bitcoin a transactions are probabilistic due to it's distributed nature and used consensus algorithms: transactions need to be verified by other nodes. Only after 3 confirmations (bitcoin) or 33 (Ethereum) one could safely claim the transaction to be final. Corda opts to use deterministic transaction finality with no need for miners.\n\n3. **Manageable Scalability**\n\n   Corda aims at providing scalability on par with current business standards: performant, resilient and available, without a central coordinator.\n\n## Platform Architecture\n\n### Point-To-Point Architecture\n\nIn Corda, only participating parties in a transaction get to see the inputs and outputs of this transaction. A transaction on a blockchain has 2 properties which are often seen as one and the same: **validity** and **uniqueness.** Corda sees these 2 properties achieved by 2 seperate actions.\n\nValidity is achieved by re-running the smart contract locally. Since the participating parties know the inputs and outputs of a transaction, they can both validate the transaction locally, or reject it if they don't agree.\n\nUniqueness of a transaction within a corda network ledger is achieved by Corda's consensus mechanism: the Notary: it will verify the uniquess of each transaction.\n\nThe Notary privately asses each block and transaction by including UTXO (Unspend transaction output) and inputs as the transaciton hash. The Notary only inspects hashes of new transactions so that every added transaction is unique in the ledger.\n\nCorda makes sure that transactions are not routed to intermediaries nor globally broadcasted. Information remains private between involved parties, while the system assures transaction uniqueness across the corda blockchain network.\n\n### Pluggable Consensus\n\nCorda facilitates the implementation of mulitple consensus algorithms within the same corda network. Certainly when thinking about scale, sharding-compatible consensus algorithms will emerge allowing it to perform at a level consistent with today's business networks.\n\nCorda supports Byzantine Fault Tolerant algorithms too, however there's no notion of proof-of-work of proof-of-stake algorithms.\n\n### Multilateral Ledgers\n\nParticipants in a network only have copies of transactions they are participants of or observers of. This means that every node is likely to have it's own unique ledger, Corda calls this feature a multilateral ledger.\n\nWhen having transactions that go through multilateral ledgers, the input of the tranastion itself must be validated. Corda features a mechanism to verify the whole history of transaction leading up to the validity of the current input. \n\nIt does this in a private manner by levaring Intel Software Quard Extensions (SGX) which are tamper-resistant memory spaces within a CPU. Only the verifiying process is able to decrypt the history of transaction, within the bounds of secure enclave.\n\nFurthermore, Corda adds confidential identity management ensuring that following transactions are unable to establish the identity of parties of prior transactions. ","reference_links":[{"_id":{"$oid":"5bb35875b69e4c2e3c00f0c8"},"name":"Homepage","url":"www.corda.net"}],"trade_off":{"pros":["Integratable technologies","Proven track-record of applications","Scalability and privacy ensured"],"cons":["Consortium blockchain","Need Kotlin developers"]}},"name":"Corda","logo_url":"https://www.corda.net/img/cordalogo.png","groupId":"5baa4b9d1c31a0412470ad6a","__v":0,"meta":{"color":"linear-gradient(45deg, #e65c00, #f9d423)","symbol":null},"groupIds":["5baa4b9d1c31a0412470ad6a"]}
{"_id":{"$oid":"5baa50da1c31a0412470ad6c"},"details":{"title":"Hyperledger","summary":null,"reference_links":[],"trade_off":{"pros":[],"cons":[]}},"name":"Hyperledger","logo_url":"https://i.redditmedia.com/YThgCJZInCmUidmRAYEVhDyuW9Mu4nnBIWCwgBVxnwc.png?w=400\u0026s=94f9b9a3f2155e75365bf820f021c7df","groupId":"5baa4b9d1c31a0412470ad6a","__v":0,"meta":{"color":"linear-gradient(45deg, #e65c00, #f9d423)","symbol":null},"groupIds":["5baa4b9d1c31a0412470ad6a"]}
{"_id":{"$oid":"5bb23f1872468835c427e866"},"details":{"title":"Bancor","summary":"Bancor allows you to convert between any two tokens on our network, with no counterparty, at an automatically calculated price. Thanks to built-in liquidity, the future of user-generated tokens is here.\n\nIt's basically an exchange, without the need for a buyer or seller.","reference_links":[{"_id":{"$oid":"5bb35862b69e4c2e3c00f0c7"},"name":"Homepage","url":"https://about.bancor.network/"}],"trade_off":{"pros":[],"cons":[]}},"name":"Bancor","logo_url":"https://cdn.worldvectorlogo.com/logos/bancor-icon.svg","groupId":"5bb23ee272468835c427e865","__v":0,"meta":{"color":"linear-gradient(45deg, #6666ff, #B32AFF)","symbol":"BNT"},"groupIds":["5bb23ee272468835c427e865"]}
